{
  "id": "tutorial-daily-github-trending-email",
  "workflowSlug": "daily-github-trending-email",
  "title": "Complete Setup Guide for Daily GitHub Trending Email",
  "description": "This tutorial guides you through setting up a workflow that sends a daily email with trending GitHub repositories. You will learn how to configure the workflow, set up credentials, and test the email sending process. By the end of this tutorial, you will have a fully functional workflow that keeps you updated on the latest GitHub trends.",
  "difficulty": "INTERMEDIATE",
  "estimatedTime": "20 minutes",
  "isAIGenerated": true,
  "steps": [
    {
      "id": "step-1",
      "order": 1,
      "title": "📚 Introduction to Daily GitHub Trending Email Workflow",
      "description": "Welcome to the Daily GitHub Trending Email workflow tutorial. This workflow is designed to send a daily email with the trending GitHub repositories, helping developers stay up-to-date with the latest trends in the GitHub community. In this tutorial, we will guide you through setting up and configuring the workflow.",
      "type": "INFO",
      "hints": [
        "Make sure you have an n8n account before starting the tutorial",
        "Familiarize yourself with the n8n workflow interface for easier navigation",
        "This workflow is perfect for developers who want to stay updated on the latest GitHub trends"
      ]
    },
    {
      "id": "step-2",
      "order": 2,
      "title": "📈 Setting Up GitHub Credentials",
      "description": "To fetch the trending GitHub repositories, you need to set up your GitHub credentials. Go to the GitHub API documentation and create a personal access token with the necessary permissions. Then, add the token to your n8n credentials.",
      "type": "ACTION",
      "hints": [
        "Use a secure password manager to store your GitHub token",
        "Make sure to select the correct permissions for the token",
        "If you encounter issues, try regenerating the token and updating your credentials"
      ],
      "codeSnippet": "1. Go to GitHub API documentation\n2. Create a personal access token\n3. Add the token to your n8n credentials"
    },
    {
      "id": "step-3",
      "order": 3,
      "title": "📧 Configuring Email Settings",
      "description": "To send the daily email, you need to configure your email settings. Go to the email node in your n8n workflow and enter your email credentials. Make sure to use a secure connection and authenticate correctly.",
      "type": "ACTION",
      "hints": [
        "Use a dedicated email account for testing and production",
        "Make sure to enable less secure apps or generate an app password",
        "Test your email connection before proceeding to the next step"
      ],
      "codeSnippet": "1. Go to the email node\n2. Enter your email credentials\n3. Test the email connection"
    },
    {
      "id": "step-4",
      "order": 4,
      "title": "🔄 Setting Up the HTTP Request",
      "description": "To fetch the trending GitHub repositories, you need to set up an HTTP request to the GitHub API. Go to the HTTP request node and enter the API endpoint URL. Make sure to add the necessary headers and parameters.",
      "type": "ACTION",
      "hints": [
        "Use the correct API endpoint URL for the trending repositories",
        "Add the necessary headers and parameters for authentication and filtering",
        "Test the HTTP request before proceeding to the next step"
      ],
      "codeSnippet": "1. Go to the HTTP request node\n2. Enter the API endpoint URL\n3. Add the necessary headers and parameters"
    },
    {
      "id": "step-5",
      "order": 5,
      "title": "📊 Testing the Workflow",
      "description": "Now that you have set up the workflow, it's time to test it. Go to the workflow settings and enable the test mode. Then, run the workflow and verify that the email is sent correctly with the trending GitHub repositories.",
      "type": "VALIDATION",
      "hints": [
        "Use a test email account to avoid spamming your production email",
        "Verify that the email contains the correct repository information",
        "If you encounter issues, check the workflow logs for errors"
      ]
    },
    {
      "id": "step-6",
      "order": 6,
      "title": "📆 Scheduling the Workflow",
      "description": "To send the daily email, you need to schedule the workflow to run daily. Go to the workflow settings and add a scheduler node. Configure the scheduler to run the workflow at the desired time every day.",
      "type": "ACTION",
      "hints": [
        "Use a reliable scheduler to ensure the workflow runs on time",
        "Make sure to configure the scheduler for the correct time zone",
        "Test the scheduler by running the workflow manually"
      ],
      "codeSnippet": "1. Go to the workflow settings\n2. Add a scheduler node\n3. Configure the scheduler"
    },
    {
      "id": "step-7",
      "order": 7,
      "title": "👏 Completion and Deployment",
      "description": "Congratulations! You have completed the Daily GitHub Trending Email workflow tutorial. You can now deploy the workflow to your production environment and start receiving daily emails with the trending GitHub repositories.",
      "type": "CHECKPOINT",
      "hints": [
        "Make sure to monitor the workflow logs for any errors or issues",
        "Use a backup system to ensure data integrity",
        "Continuously improve the workflow by adding new features and nodes"
      ]
    }
  ]
}